zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_mcwdt_b.c
/***************************************************************************//**
* \file cy_mcwdt_b.c
* \version 1.100.1
*
*  Description:
*   Provides a system API for the MCWDT driver.
*
********************************************************************************
* \copyright
* (c) 2016-2026, Infineon Technologies AG or an affiliate of
* Infineon Technologies AG.
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#include "cy_device.h"

#if (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 2)) || defined(CY_DOXYGEN)

#include "cy_mcwdt.h"

#if defined(__cplusplus)
extern "C" {
#endif

/*******************************************************************************
* Function Name: Cy_MCWDT_Init
****************************************************************************//**
*
* Initializes the MCWDT_B block.
*
*  \param base
*  The base pointer to a structure that describes the registers.
*
*  \param config
*  The pointer to a structure that contains component configuration data.
*
* \return cy_en_mcwdt_status_t
*     *base checking result. If the pointer is NULL, returns error.
*
*  \note
*  This API should not be called when the counters are running. Prior to calling
*  this API the counter should be disabled.
*
* \funcusage
* \snippet mcwdt_b/snippet/main.c snippet_Cy_MCWDT_Init
*
*******************************************************************************/
cy_en_mcwdt_status_t Cy_MCWDT_Init(MCWDT_Type *base, cy_stc_mcwdt_config_t const *config)
{
    cy_en_mcwdt_status_t ret = CY_MCWDT_BAD_PARAM;
    if ((base != NULL) && (config != NULL))
    {
        Cy_MCWDT_Unlock(base);

        Cy_MCWDT_CpuSelectForDpSlpPauseAction(base, config->coreSelect);

        Cy_MCWDT_SetLowerLimit(base, CY_MCWDT_COUNTER0, config->c0LowerLimit, 0);
        Cy_MCWDT_SetUpperLimit(base, CY_MCWDT_COUNTER0, config->c0UpperLimit, 0);
        Cy_MCWDT_SetWarnLimit(base, CY_MCWDT_COUNTER0, config->c0WarnLimit, 0);

        MCWDT_CTR_CONFIG(base, CY_MCWDT_COUNTER0) = _VAL2FLD(MCWDT_CTR_CONFIG_LOWER_ACTION, config->c0LowerAction)   |
                                               _VAL2FLD(MCWDT_CTR_CONFIG_UPPER_ACTION, config->c0UpperAction)       |
                                               _VAL2FLD(MCWDT_CTR_CONFIG_WARN_ACTION, config->c0WarnAction)         |
                                               _VAL2FLD(MCWDT_CTR_CONFIG_AUTO_SERVICE, config->c0AutoService)       |
                                               _VAL2FLD(MCWDT_CTR_CONFIG_SLEEPDEEP_PAUSE, config->c0SleepDeepPause) |
                                               _VAL2FLD(MCWDT_CTR_CONFIG_DEBUG_RUN, config->c0DebugRun);


        Cy_MCWDT_SetLowerLimit(base, CY_MCWDT_COUNTER1, config->c1LowerLimit, 0);
        Cy_MCWDT_SetUpperLimit(base, CY_MCWDT_COUNTER1, config->c1UpperLimit, 0);
        Cy_MCWDT_SetWarnLimit(base, CY_MCWDT_COUNTER1, config->c1WarnLimit, 0);

        MCWDT_CTR_CONFIG(base, CY_MCWDT_COUNTER1) = _VAL2FLD(MCWDT_CTR_CONFIG_LOWER_ACTION, config->c1LowerAction)   |
                                               _VAL2FLD(MCWDT_CTR_CONFIG_UPPER_ACTION, config->c1UpperAction)       |
                                               _VAL2FLD(MCWDT_CTR_CONFIG_WARN_ACTION, config->c1WarnAction)         |
                                               _VAL2FLD(MCWDT_CTR_CONFIG_AUTO_SERVICE, config->c1AutoService)       |
                                               _VAL2FLD(MCWDT_CTR_CONFIG_SLEEPDEEP_PAUSE, config->c1SleepDeepPause) |
                                               _VAL2FLD(MCWDT_CTR_CONFIG_DEBUG_RUN, config->c1DebugRun);

        MCWDT_CTR2_CONFIG(base) = _VAL2FLD(MCWDT_CTR2_CONFIG_BITS, config->c2ToggleBit)   |
                              _VAL2FLD(MCWDT_CTR2_CONFIG_ACTION, config->c2Action)       |
                              _VAL2FLD(MCWDT_CTR2_CONFIG_SLEEPDEEP_PAUSE, config->c2SleepDeepPause)         |
                              _VAL2FLD(MCWDT_CTR2_CONFIG_DEBUG_RUN, config->c2DebugRun);

        Cy_MCWDT_Lock(base);

        ret = CY_MCWDT_SUCCESS;
    }

    return (ret);
}


/*******************************************************************************
* Function Name: Cy_MCWDT_DeInit
****************************************************************************//**
*
*  De-initializes the MCWDT block, returns register values to their default state.
*
*  \param base
*  The base pointer to a structure that describes the registers.
*
*  \note
*  This API should not be called when the counters are running. Prior to calling
*  this API the counter should be disabled.
*
* \funcusage
* \snippet mcwdt_b/snippet/main.c snippet_Cy_MCWDT_DeInit
*
*******************************************************************************/
void Cy_MCWDT_DeInit(MCWDT_Type *base)
{
    Cy_MCWDT_Unlock(base);

    // disable all counter
    Cy_MCWDT_Disable(base, CY_MCWDT_CTR0, 0);
    Cy_MCWDT_Disable(base, CY_MCWDT_CTR1, 0);
    Cy_MCWDT_Disable(base, CY_MCWDT_CTR2, 0);

    /* De-Init counter-0 */
    while(Cy_MCWDT_GetEnabledStatus(base, CY_MCWDT_COUNTER0)  != 0x0UL)
    {
        // wait until enabled bit become 1
    }
    Cy_MCWDT_SetLowerLimit(base, CY_MCWDT_COUNTER0, 0x0U, 0);
    Cy_MCWDT_SetUpperLimit(base, CY_MCWDT_COUNTER0, 0x0U, 0);
    Cy_MCWDT_SetWarnLimit(base, CY_MCWDT_COUNTER0, 0x0U, 0);
    MCWDT_CTR_CONFIG(base, CY_MCWDT_COUNTER0) = 0x0UL;
    MCWDT_CTR_CNT(base, CY_MCWDT_COUNTER0) = 0x0UL;

    /* De-Init counter-1 */
    while(Cy_MCWDT_GetEnabledStatus(base, CY_MCWDT_COUNTER1)  != 0x0UL)
    {
        // wait until enabled bit become 1
    }
    Cy_MCWDT_SetLowerLimit(base, CY_MCWDT_COUNTER1, 0x0U, 0);
    Cy_MCWDT_SetUpperLimit(base, CY_MCWDT_COUNTER1, 0x0U, 0);
    Cy_MCWDT_SetWarnLimit(base, CY_MCWDT_COUNTER1, 0x0U, 0);
    MCWDT_CTR_CONFIG(base, CY_MCWDT_COUNTER1) = 0x0UL;
    MCWDT_CTR_CNT(base, CY_MCWDT_COUNTER1) = 0x0UL;

    /* De-Init counter-2 */
    while(Cy_MCWDT_GetEnabledStatus(base, CY_MCWDT_COUNTER2)  != 0x0UL)
    {
        // wait until enabled bit become 1
    }
    Cy_MCWDT_CpuSelectForDpSlpPauseAction(base, CY_MCWDT_PAUSED_BY_DPSLP_CM0);
    MCWDT_CTR2_CONFIG(base) = 0x0UL;
    Cy_MCWDT_ResetCounters(base, CY_MCWDT_CTR0, 0);
    Cy_MCWDT_ResetCounters(base, CY_MCWDT_CTR1, 0);
    MCWDT_INTR(base) = 0xFFFFFFFFUL;
    MCWDT_INTR_MASK(base) = 0x0UL;

