zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_mcwdt_b.c
CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 10.8', 4, 'Intentional typecast to cy_en_mcwdt_lower_upper_action_t enum.')
/*******************************************************************************
* Function Name: Cy_MCWDT_GetLowerAction
****************************************************************************//**
*
*  Reports the lower limit action type of the specified counter.
*
*  \param base
*  The base pointer to a structure that describes registers.
*
*  \param counter
*  The number of the WDT counter. The valid range is [0-1].
*
*  \return
*  The current lower limit action type of the counter.
*  See enum typedef cy_en_mcwdt_lower_upper_action_t.
*
* \note
* This API is available for CAT1C devices.
*
*******************************************************************************/
cy_en_mcwdt_lower_upper_action_t Cy_MCWDT_GetLowerAction(MCWDT_Type *base, cy_en_mcwdtctr_t counter)
{
    cy_en_mcwdt_lower_upper_action_t lowerLimitActionType = CY_MCWDT_ACTION_NONE;

    switch (counter)
    {
    case CY_MCWDT_COUNTER0:
        lowerLimitActionType = (cy_en_mcwdt_lower_upper_action_t)(_FLD2VAL(MCWDT_CTR_CONFIG_LOWER_ACTION, MCWDT_CTR_CONFIG(base, CY_MCWDT_COUNTER0)));
        break;
    case CY_MCWDT_COUNTER1:
        lowerLimitActionType = (cy_en_mcwdt_lower_upper_action_t)(_FLD2VAL(MCWDT_CTR_CONFIG_LOWER_ACTION, MCWDT_CTR_CONFIG(base, CY_MCWDT_COUNTER1)));
        break;
    default:
        CY_ASSERT(0u != 0u);
        break;
    }

    return lowerLimitActionType; /* Control shouldn't reach here, fixes IAR compilation warning */
}

/*******************************************************************************
* Function Name: Cy_MCWDT_GetUpperAction
****************************************************************************//**
*
*  Reports the upper limit action type of the specified counter.
*
*  \param base
*  The base pointer to a structure that describes registers.
*
*  \param counter
*  The number of the WDT counter. The valid range is [0-1].
*
*  \return
*  The current upper limit action type of the counter.
*  See enum typedef cy_en_mcwdt_lower_upper_action_t.
*
* \note
* This API is available for CAT1C devices.
*
*******************************************************************************/
cy_en_mcwdt_lower_upper_action_t  Cy_MCWDT_GetUpperAction(MCWDT_Type *base, cy_en_mcwdtctr_t counter)
{
    cy_en_mcwdt_lower_upper_action_t upperLimitActionType = CY_MCWDT_ACTION_NONE;

    switch (counter)
    {
    case CY_MCWDT_COUNTER0:
        upperLimitActionType = (cy_en_mcwdt_lower_upper_action_t)(_FLD2VAL(MCWDT_CTR_CONFIG_UPPER_ACTION, MCWDT_CTR_CONFIG(base, CY_MCWDT_COUNTER0)));
        break;
    case CY_MCWDT_COUNTER1:
        upperLimitActionType = (cy_en_mcwdt_lower_upper_action_t)(_FLD2VAL(MCWDT_CTR_CONFIG_UPPER_ACTION, MCWDT_CTR_CONFIG(base, CY_MCWDT_COUNTER1)));
        break;
    default:
        CY_ASSERT(0u != 0u);
        break;
    }

    return upperLimitActionType; /* Control shouldn't reach here, fixes IAR compilation warning */
}
CY_MISRA_BLOCK_END('MISRA C-2012 Rule 10.8')

/*******************************************************************************
* Function Name: Cy_MCWDT_GetWarnAction
****************************************************************************//**
*
*  Reports the warn limit action type of the specified counter.
*
*  \param base
*  The base pointer to a structure that describes registers.
*
*  \param counter
*  The number of the WDT counter. The valid range is [0-1].
*
*  \return
*  The current warn limit action type of the counter.
*  See enum typedef cy_en_mcwdt_warn_action_t.
*
* \note
* This API is available for CAT1C devices.
*
*******************************************************************************/
cy_en_mcwdt_warn_action_t Cy_MCWDT_GetWarnAction(MCWDT_Type *base, cy_en_mcwdtctr_t counter)
{
    cy_en_mcwdt_warn_action_t warnAction = CY_MCWDT_WARN_ACTION_NONE;

    switch (counter)
    {
    case CY_MCWDT_COUNTER0:
    {
        CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8','Intentional typecast to cy_en_mcwdt_warn_action_t enum.');
        warnAction = (cy_en_mcwdt_warn_action_t)(_FLD2VAL(MCWDT_CTR_CONFIG_WARN_ACTION, MCWDT_CTR_CONFIG(base, CY_MCWDT_COUNTER0)));
        break;
    }
    case CY_MCWDT_COUNTER1:
    {
        CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8','Intentional typecast to cy_en_mcwdt_warn_action_t enum.');
        warnAction = (cy_en_mcwdt_warn_action_t)(_FLD2VAL(MCWDT_CTR_CONFIG_WARN_ACTION, MCWDT_CTR_CONFIG(base, CY_MCWDT_COUNTER1)));
        break;
    }
    default:
        CY_ASSERT(0u != 0u);
        break;
    }

    return warnAction; /* Control shouldn't reach here, fixes IAR compilation warning */
}

/*******************************************************************************
* Function Name: Cy_MCWDT_GetSubCounter2Action
****************************************************************************//**
*
*  Reports the counter 2 action type of the specified counter.
*
*  \param base
*  The base pointer to a structure that describes registers.
*
*  \return
*  The current counter 2 action type of the counter.
*  See enum typedef cy_en_mcwdt_cnt2_action_t.
*
* \note
* This API is available for CAT1C devices.
*
*******************************************************************************/
cy_en_mcwdt_cnt2_action_t Cy_MCWDT_GetSubCounter2Action(MCWDT_Type *base)
{
    CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8','Intentional typecast to cy_en_mcwdt_cnt2_action_t enum.');
    return (cy_en_mcwdt_cnt2_action_t)(_FLD2VAL(MCWDT_CTR2_CONFIG_ACTION, MCWDT_CTR2_CONFIG(base)));
}

/*******************************************************************************
* Function Name: Cy_MCWDT_SetAutoService
****************************************************************************//**
*
*  Sets the Auto service option for the specified counter.
*
*  \param base
*  The base pointer to a structure that describes registers.
*
*  \param counter
*   The number of the WDT counter. The valid range is [0-1].
*
*  \note
*  The auto service option is not supported by Counter 2.
*
*  \param enable
*  Set 0 to disable; 1 to enable.
*
*  \note
*  This API must not be called while the counters are running.
*  Prior to calling this API, the counter must be disabled.
*
* \note
* This API is available for CAT1C devices.
*
*******************************************************************************/
void Cy_MCWDT_SetAutoService(MCWDT_Type *base, cy_en_mcwdtctr_t counter, uint32_t enable)
{
    switch (counter)
    {
    case CY_MCWDT_COUNTER0:
        MCWDT_CTR_CONFIG(base, CY_MCWDT_COUNTER0) = _CLR_SET_FLD32U(MCWDT_CTR_CONFIG(base, CY_MCWDT_COUNTER0), MCWDT_CTR_CONFIG_AUTO_SERVICE, enable);
        break;
    case CY_MCWDT_COUNTER1:
        MCWDT_CTR_CONFIG(base, CY_MCWDT_COUNTER1) = _CLR_SET_FLD32U(MCWDT_CTR_CONFIG(base, CY_MCWDT_COUNTER1), MCWDT_CTR_CONFIG_AUTO_SERVICE, enable);
        break;
    default:
        CY_ASSERT(0u != 0u);
        break;
    }
}


