zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_mcwdt_b.c
/*******************************************************************************
* Function Name: Cy_MCWDT_GetAutoService
****************************************************************************//**
*
*  Reports the Auto service setting for the specified counter.
*
*  \param base
*  The base pointer to a structure that describes registers.
*
*  \param counter
*  The number of the WDT counter. The valid range is [0-1].
*
*  \return
*  The Auto service status: 1 = enabled, 0 = disabled.
*
*  \note
*  The Auto service option is not supported by Counter 2.
*
* \note
* This API is available for CAT1C devices.
*
*******************************************************************************/
uint32_t Cy_MCWDT_GetAutoService(MCWDT_Type const *base, cy_en_mcwdtctr_t counter)
{

    uint32_t retVal = 0UL;

    switch (counter)
    {
    case CY_MCWDT_COUNTER0:
        retVal = (_FLD2VAL(MCWDT_CTR_CONFIG_AUTO_SERVICE, MCWDT_CTR_CONFIG(base, CY_MCWDT_COUNTER0)));
        break;
    case CY_MCWDT_COUNTER1:
        retVal = (_FLD2VAL(MCWDT_CTR_CONFIG_AUTO_SERVICE, MCWDT_CTR_CONFIG(base, CY_MCWDT_COUNTER1)));
        break;
    default:
        CY_ASSERT(0u != 0u);
        break;
    }

    return retVal;/* Control shouldn't reach here, fixes IAR compilation warning */
}

/*******************************************************************************
* Function Name: Cy_MCWDT_SetSleepDeepPause
****************************************************************************//**
*
*  Sets the Sleep deep pause option for the specified counter.
*
*  \param base
*  The base pointer to a structure that describes registers.
*
*  \param counter
*   The number of the WDT counter. The valid range is [0-2].
*
*  \param enable
*  Set 0 to disable; 1 to enable.
*
*  \note
*  This API must not be called while the counters are running.
*  Prior to calling this API, the counter must be disabled.
*
* \note
* This API is available for CAT1C devices.
*
*******************************************************************************/
void Cy_MCWDT_SetSleepDeepPause(MCWDT_Type *base, cy_en_mcwdtctr_t counter, uint32_t enable)
{
    switch (counter)
    {
    case CY_MCWDT_COUNTER0:
        MCWDT_CTR_CONFIG(base, CY_MCWDT_COUNTER0) = _CLR_SET_FLD32U(MCWDT_CTR_CONFIG(base, CY_MCWDT_COUNTER0), MCWDT_CTR_CONFIG_SLEEPDEEP_PAUSE, enable);
        break;
    case CY_MCWDT_COUNTER1:
        MCWDT_CTR_CONFIG(base, CY_MCWDT_COUNTER1) = _CLR_SET_FLD32U(MCWDT_CTR_CONFIG(base, CY_MCWDT_COUNTER1), MCWDT_CTR_CONFIG_SLEEPDEEP_PAUSE, enable);
        break;
    case CY_MCWDT_COUNTER2:
        MCWDT_CTR2_CONFIG(base) = _CLR_SET_FLD32U(MCWDT_CTR2_CONFIG(base), MCWDT_CTR2_CONFIG_SLEEPDEEP_PAUSE, enable);
        break;
    default:
        CY_ASSERT(0u != 0u);
        break;
    }
}


/*******************************************************************************
* Function Name: Cy_MCWDT_GetSleepDeepPause
****************************************************************************//**
*
*  Reports the Sleep deep pause setting for the specified counter.
*
*  \param base
*  The base pointer to a structure that describes registers.
*
*  \param counter
*  The number of the WDT counter. The valid range is [0-2].
*
*  \return
*  The Auto service status: 1 = enabled, 0 = disabled.
*
* \note
* This API is available for CAT1C devices.
*
*******************************************************************************/
uint32_t Cy_MCWDT_GetSleepDeepPause(MCWDT_Type const *base, cy_en_mcwdtctr_t counter)
{
    uint32_t retVal = 0UL;

    switch (counter)
    {
    case CY_MCWDT_COUNTER0:
        retVal = (_FLD2VAL(MCWDT_CTR_CONFIG_SLEEPDEEP_PAUSE, MCWDT_CTR_CONFIG(base, CY_MCWDT_COUNTER0)));
        break;
    case CY_MCWDT_COUNTER1:
        retVal = (_FLD2VAL(MCWDT_CTR_CONFIG_SLEEPDEEP_PAUSE, MCWDT_CTR_CONFIG(base, CY_MCWDT_COUNTER1)));
        break;
    case CY_MCWDT_COUNTER2:
        retVal = (_FLD2VAL(MCWDT_CTR2_CONFIG_SLEEPDEEP_PAUSE, MCWDT_CTR2_CONFIG(base)));
        break;
    default:
        CY_ASSERT(0u != 0u);
        break;
    }

    return retVal;/* Control shouldn't reach here, fixes IAR compilation warning */
}

/*******************************************************************************
* Function Name: Cy_MCWDT_SetDebugRun
****************************************************************************//**
*
*  Sets the Debug run option for the specified counter.
*
*  \param base
*  The base pointer to a structure that describes registers.
*
*  \param counter
*   The number of the WDT counter. The valid range is [0-2].
*
*  \param enable
*  Set 0 to disable; 1 to enable.
*
*  \note
*  This API must not be called while the counters are running.
*  Prior to calling this API, the counter must be disabled.
*
* \note
* This API is available for CAT1C devices.
*
*******************************************************************************/
void Cy_MCWDT_SetDebugRun(MCWDT_Type *base, cy_en_mcwdtctr_t counter, uint32_t enable)
{
    switch (counter)
    {
    case CY_MCWDT_COUNTER0:
        MCWDT_CTR_CONFIG(base, CY_MCWDT_COUNTER0) = _CLR_SET_FLD32U(MCWDT_CTR_CONFIG(base, CY_MCWDT_COUNTER0), MCWDT_CTR_CONFIG_DEBUG_RUN, enable);
        break;
    case CY_MCWDT_COUNTER1:
        MCWDT_CTR_CONFIG(base, CY_MCWDT_COUNTER1) = _CLR_SET_FLD32U(MCWDT_CTR_CONFIG(base, CY_MCWDT_COUNTER1), MCWDT_CTR_CONFIG_DEBUG_RUN, enable);
        break;
    case CY_MCWDT_COUNTER2:
        MCWDT_CTR2_CONFIG(base) = _CLR_SET_FLD32U(MCWDT_CTR2_CONFIG(base), MCWDT_CTR2_CONFIG_DEBUG_RUN, enable);
        break;
    default:
        CY_ASSERT(0u != 0u);
        break;
    }
}


/*******************************************************************************
* Function Name: Cy_MCWDT_GetDebugRun
****************************************************************************//**
*
*  Reports the Debug run setting for the specified counter.
*
*  \param base
*  The base pointer to a structure that describes registers.
*
*  \param counter
*  The number of the WDT counter. The valid range is [0-2].
*
*  \return
*  The Auto service status: 1 = enabled, 0 = disabled.
*
* \note
* This API is available for CAT1C devices.
*
*******************************************************************************/
uint32_t Cy_MCWDT_GetDebugRun(MCWDT_Type const *base, cy_en_mcwdtctr_t counter)
{
    uint32_t retVal = 0UL;

    switch (counter)
    {
    case CY_MCWDT_COUNTER0:
        retVal = (_FLD2VAL(MCWDT_CTR_CONFIG_DEBUG_RUN, MCWDT_CTR_CONFIG(base, CY_MCWDT_COUNTER0)));
        break;
    case CY_MCWDT_COUNTER1:
        retVal = (_FLD2VAL(MCWDT_CTR_CONFIG_DEBUG_RUN, MCWDT_CTR_CONFIG(base, CY_MCWDT_COUNTER1)));
        break;
    case CY_MCWDT_COUNTER2:
        retVal = (_FLD2VAL(MCWDT_CTR2_CONFIG_DEBUG_RUN, MCWDT_CTR2_CONFIG(base)));
        break;
    default:
        CY_ASSERT(0u != 0u);
        break;
    }

    return retVal;/* Control shouldn't reach here, fixes IAR compilation warning */
}


